# Brewfile

# Homebrew taps
tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mongodb/brew"
tap "shivammathur/php"

# Brew packages
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "automake"
brew "bison"
brew "boost"
brew "bzip2"
brew "python@3.12"
brew "unbound"
brew "gnutls"
brew "cask"
brew "chruby"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "curl"
brew "libavif"
brew "gd"
brew "libpq"
brew "libzip"
brew "php"
brew "composer"
brew "dnsmasq"
brew "docker"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "gnupg"
brew "git-secret"
brew "git-secrets"
brew "go"
brew "jenkins"
brew "jenkins-lts", restart_service: true
brew "ko"
brew "libfido2"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "mhash"
brew "node"
brew "mongosh"
brew "mysql", restart_service: true
brew "numpy"
brew "nest"
brew "nginx"
brew "node@16"
brew "nvm"
brew "openjdk@17"
brew "openssl@1.1"
brew "php@8.0"
brew "php@8.1"
brew "phpbrew"
brew "pipenv"
brew "pkg-config"
brew "postgresql@14"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ruby-install"
brew "telnet"
brew "tree"
brew "virtualenv"
brew "watchman"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.4"

# Cask applications
cask "adoptopenjdk"
cask "android-studio"
cask "chatgpt"
cask "chromedriver"
cask "font-fira-code"
cask "gather"
cask "gcollazo-mongodb"
cask "goland"
cask "google-chrome"
cask "hashicorp-vagrant"
cask "mongodb-compass"
cask "pycharm"
cask "sequel-ace"
cask "temurin"
cask "visual-studio-code"
cask "zulu11"

# Mac App Store applications
mas "DayCounter", id: 1514821100
mas "Dynamic Wallpaper", id: 1453504509
mas "Gifski", id: 1351639930
mas "Goodnotes", id: 1444383602
mas "Hola Translator", id: 1518955356
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Save to Pocket", id: 1477385213
mas "VCE Simulator", id: 1459356760
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959

# VSCode extensions
vscode "adpyke.codesnap"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eg2.vscode-npm-script"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "georgewfraser.vscode-javac"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "hazer.reactcodesnippets"
vscode "hookyqr.beautify"
vscode "humao.rest-client"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kimseungtae.aicodehelper"
vscode "mathiasfrohlich.kotlin"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "orsenkucher.vscode-graphql"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "seatonjiang.gitmoji-vscode"
vscode "shalldie.background"
vscode "shan.code-settings-sync"
vscode "shinymimikyu.pokemon-color"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wakatime.vscode-wakatime"
vscode "walkme.java-extension-pack"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"